bdring/FluidNC/FluidNC/esp32/fnc_idf_uart.c
/*
 * SPDX-FileCopyrightText: 2015-2021 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include <string.h>
#include "esp_types.h"
#include "esp_attr.h"
#include "esp_intr_alloc.h"
#include "esp_log.h"
#include "esp_err.h"
#include "esp_check.h"
#include "malloc.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/ringbuf.h"
#include "hal/uart_hal.h"
#include "hal/gpio_hal.h"
#include "soc/uart_periph.h"
#include "soc/rtc_cntl_reg.h"
#include "driver/uart.h"
#include "fnc_idf_uart.h"
#include "driver/gpio.h"
#include "driver/uart_select.h"
#include "driver/periph_ctrl.h"
#include "sdkconfig.h"
#include "esp_rom_gpio.h"

#if CONFIG_IDF_TARGET_ESP32
#    include "esp32/clk.h"
#elif CONFIG_IDF_TARGET_ESP32S2
#    include "esp32s2/clk.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#    include "esp32s3/clk.h"
#elif CONFIG_IDF_TARGET_ESP32C3
#    include "esp32c3/clk.h"
#elif CONFIG_IDF_TARGET_ESP32H2
#    include "esp32h2/clk.h"
#endif

#ifdef CONFIG_UART_ISR_IN_IRAM
#    define UART_ISR_ATTR IRAM_ATTR
#    define UART_MALLOC_CAPS (MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)
#else
#    define UART_ISR_ATTR
#    define UART_MALLOC_CAPS MALLOC_CAP_DEFAULT
#endif

#define XOFF (0x13)
#define XON (0x11)

static const char* UART_TAG = "uart";

#define UART_EMPTY_THRESH_DEFAULT (10)
#define UART_FULL_THRESH_DEFAULT (120)
#define UART_TOUT_THRESH_DEFAULT (10)
#define UART_CLKDIV_FRAG_BIT_WIDTH (3)
#define UART_TX_IDLE_NUM_DEFAULT (0)
#define UART_PATTERN_DET_QLEN_DEFAULT (10)
#define UART_MIN_WAKEUP_THRESH (UART_LL_MIN_WAKEUP_THRESH)

#define UART_INTR_CONFIG_FLAG                                                                                                              \
    ((UART_INTR_RXFIFO_FULL) | (UART_INTR_RXFIFO_TOUT) | (UART_INTR_RXFIFO_OVF) | (UART_INTR_BRK_DET) | (UART_INTR_PARITY_ERR))

#define UART_ENTER_CRITICAL_ISR(mux) portENTER_CRITICAL_ISR(mux)
#define UART_EXIT_CRITICAL_ISR(mux) portEXIT_CRITICAL_ISR(mux)
#define UART_ENTER_CRITICAL(mux) portENTER_CRITICAL(mux)
#define UART_EXIT_CRITICAL(mux) portEXIT_CRITICAL(mux)

// Check actual UART mode set
#define UART_IS_MODE_SET(uart_number, mode) ((p_uart_obj[uart_number]->uart_mode == mode))

#define UART_CONTEX_INIT_DEF(uart_num)                                                                                                     \
    { .hal.dev = UART_LL_GET_HW(uart_num), .spinlock = portMUX_INITIALIZER_UNLOCKED, .hw_enabled = false, }

#if SOC_UART_SUPPORT_RTC_CLK
#    define RTC_ENABLED(uart_num) (BIT(uart_num))
#endif

typedef struct {
    uart_event_type_t type; /*!< UART TX data type */
    struct {
        int     brk_len;
        size_t  size;
        uint8_t data[0];
    } tx_data;
} uart_tx_data_t;

typedef struct {
    int  wr;
    int  rd;
    int  len;
    int* data;
} uart_pat_rb_t;

typedef struct {
    uart_port_t                  uart_num;                       /*!< UART port number*/
    int                          event_queue_size;               /*!< UART event queue size*/
    intr_handle_t                intr_handle;                    /*!< UART interrupt handle*/
    uart_mode_t                  uart_mode;                      /*!< UART controller actual mode set by uart_set_mode() */
    bool                         coll_det_flg;                   /*!< UART collision detection flag */
    bool                         rx_always_timeout_flg;          /*!< UART always detect rx timeout flag */
    int                          rx_buffered_len;                /*!< UART cached data length */
    int                          rx_buf_size;                    /*!< RX ring buffer size */
    bool                         rx_buffer_full_flg;             /*!< RX ring buffer full flag. */
    uint32_t                     rx_cur_remain;                  /*!< Data number that waiting to be read out in ring buffer item*/
    uint8_t*                     rx_ptr;                         /*!< pointer to the current data in ring buffer*/
    uint8_t*                     rx_head_ptr;                    /*!< pointer to the head of RX item*/
    uint8_t                      rx_data_buf[SOC_UART_FIFO_LEN]; /*!< Data buffer to stash FIFO data*/
    uint8_t                      rx_stash_len; /*!< stashed data length.(When using flow control, after reading out FIFO data, if we fail to push to buffer, we can just stash them.) */
    uart_pat_rb_t                rx_pattern_pos;
    int                          tx_buf_size; /*!< TX ring buffer size */
    bool                         tx_waiting_fifo; /*!< this flag indicates that some task is waiting for FIFO empty interrupt, used to send all data without any data buffer*/
    uint8_t*                     tx_ptr;     /*!< TX data pointer to push to FIFO in TX buffer mode*/
    uart_tx_data_t*              tx_head;    /*!< TX data pointer to head of the current buffer in TX ring buffer*/
    uint32_t                     tx_len_tot; /*!< Total length of current item in ring buffer*/
    uint32_t                     tx_len_cur;
    uint8_t                      tx_brk_flg; /*!< Flag to indicate to send a break signal in the end of the item sending procedure */
    uint8_t                      tx_brk_len; /*!< TX break signal cycle length/number */
    uint8_t                      tx_waiting_brk; /*!< Flag to indicate that TX FIFO is ready to send break signal after FIFO is empty, do not push data into TX FIFO right now.*/
    uart_select_notif_callback_t uart_select_notif_callback; /*!< Notification about select() events */
    uart_data_callback_t         uart_data_callback;         /*!< Callback for data modification>*/
    QueueHandle_t                event_queue;                /*!< UART event queue handler*/
    RingbufHandle_t              rx_ring_buf;                /*!< RX ring buffer handler*/
    RingbufHandle_t              tx_ring_buf;                /*!< TX ring buffer handler*/
    SemaphoreHandle_t            rx_mux;                     /*!< UART RX data mutex*/
    SemaphoreHandle_t            tx_mux;                     /*!< UART TX mutex*/
    SemaphoreHandle_t            tx_fifo_sem;                /*!< UART TX FIFO semaphore*/
    SemaphoreHandle_t            tx_done_sem;                /*!< UART TX done semaphore*/
    SemaphoreHandle_t            tx_brk_sem;                 /*!< UART TX send break done semaphore*/
#if CONFIG_UART_ISR_IN_IRAM
    void* event_queue_storage;
    void* event_queue_struct;
    void* rx_ring_buf_storage;
    void* rx_ring_buf_struct;
    void* tx_ring_buf_storage;
    void* tx_ring_buf_struct;
    void* rx_mux_struct;
    void* tx_mux_struct;
    void* tx_fifo_sem_struct;
    void* tx_done_sem_struct;
    void* tx_brk_sem_struct;
#endif
} uart_obj_t;

